<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom"><title>Reversing blog by weka - Customization</title><link href="/" rel="alternate"></link><link href="/feeds/customization.atom.xml" rel="self"></link><id>/</id><updated>2023-02-01T00:00:00+05:00</updated><entry><title>Делаем работу с отладчиками удобнее</title><link href="/customize-your-debugger.html" rel="alternate"></link><published>2023-02-01T00:00:00+05:00</published><updated>2023-02-01T00:00:00+05:00</updated><author><name>weka</name></author><id>tag:None,2023-02-01:/customize-your-debugger.html</id><summary type="html">&lt;p&gt;В этой статье речь пойдёт о том, как поменять цветовую палтру, шрифт, а также другие фишки в популярных C# дебаггерах - dnSpy и ilSpy.&lt;/p&gt;</summary><content type="html">&lt;h2 id="pochemu"&gt;&lt;p class="colored-text-1" style="font-size: 32px;"&gt;&amp;gt;&lt;/p&gt; &amp;Pcy;&amp;ocy;&amp;chcy;&amp;iecy;&amp;mcy;&amp;ucy;?&lt;/h2&gt;
&lt;p&gt;&amp;Kcy;&amp;ocy;&amp;gcy;&amp;dcy;&amp;acy; &amp;rcy;&amp;acy;&amp;zcy;&amp;rcy;&amp;acy;&amp;bcy;&amp;ocy;&amp;tcy;&amp;chcy;&amp;icy;&amp;kcy;&amp;acy;&amp;mcy; &amp;pcy;&amp;rcy;&amp;icy;&amp;lcy;&amp;ocy;&amp;zhcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;jcy; &amp;ucy;&amp;dcy;&amp;acy;&amp;iocy;&amp;tcy;&amp;scy;&amp;yacy; &amp;scy;&amp;dcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;pcy;&amp;rcy;&amp;icy;&amp;yacy;&amp;tcy;&amp;ncy;&amp;ocy; &amp;vcy;&amp;ycy;&amp;gcy;&amp;lcy;&amp;yacy;&amp;dcy;&amp;yacy;&amp;shchcy;&amp;icy;&amp;jcy; &amp;icy;&amp;ncy;&amp;tcy;&amp;iecy;&amp;rcy;&amp;fcy;&amp;iecy;&amp;jcy;&amp;scy; - &amp;ecy;&amp;tcy;&amp;ocy; &amp;zcy;&amp;acy;&amp;mcy;&amp;iecy;&amp;chcy;&amp;acy;&amp;tcy;&amp;iecy;&amp;lcy;&amp;softcy;&amp;ncy;&amp;ocy;. &amp;Ocy;&amp;dcy;&amp;ncy;&amp;acy;&amp;kcy;&amp;ocy;, &amp;ncy;&amp;iecy; &amp;vcy;&amp;scy;&amp;iecy;&amp;gcy;&amp;dcy;&amp;acy; &amp;ecy;&amp;tcy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;ucy;&amp;dcy;&amp;acy;&amp;iecy;&amp;tcy;&amp;scy;&amp;yacy; &amp;dcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;icy;&amp;chcy;&amp;softcy;. &amp;Vcy;&amp;ocy;&amp;zcy;&amp;ncy;&amp;icy;&amp;kcy;&amp;acy;&amp;iecy;&amp;tcy; &amp;kcy;&amp;lcy;&amp;acy;&amp;scy;&amp;scy;&amp;icy;&amp;chcy;&amp;iecy;&amp;scy;&amp;kcy;&amp;acy;&amp;yacy; &amp;pcy;&amp;rcy;&amp;ocy;&amp;bcy;&amp;lcy;&amp;iecy;&amp;mcy;&amp;acy; &lt;em&gt;&amp;ldquo;&amp;yucy;&amp;zcy;&amp;iecy;&amp;rcy;&amp;acy;&amp;rdquo;&lt;/em&gt;: &amp;pcy;&amp;ocy;&amp;lcy;&amp;softcy;&amp;zcy;&amp;ocy;&amp;vcy;&amp;acy;&amp;tcy;&amp;iecy;&amp;lcy;&amp;yacy; &amp;ncy;&amp;iecy; &amp;ucy;&amp;scy;&amp;tcy;&amp;rcy;&amp;acy;&amp;icy;&amp;vcy;&amp;acy;&amp;iecy;&amp;tcy; &amp;rcy;&amp;iecy;&amp;shcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;iecy;, &amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ocy;&amp;iecy; &amp;pcy;&amp;ocy;&amp;kcy;&amp;acy;&amp;zcy;&amp;acy;&amp;lcy;&amp;ocy;&amp;scy;&amp;softcy; &amp;acy;&amp;vcy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;acy;&amp;mcy; &amp;ocy;&amp;pcy;&amp;tcy;&amp;icy;&amp;mcy;&amp;acy;&amp;lcy;&amp;softcy;&amp;ncy;&amp;ycy;&amp;mcy;, &amp;icy; &amp;ocy;&amp;ncy; &amp;khcy;&amp;ocy;&amp;chcy;&amp;iecy;&amp;tcy; &amp;chcy;&amp;tcy;&amp;ocy;-&amp;tcy;&amp;ocy; &amp;pcy;&amp;ocy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy;&amp;tcy;&amp;softcy;. &amp;Ocy;&amp;scy;&amp;ocy;&amp;bcy;&amp;iecy;&amp;ncy;&amp;ncy;&amp;ocy; &amp;scy;&amp;icy;&amp;lcy;&amp;softcy;&amp;ncy;&amp;ocy; &amp;ecy;&amp;tcy;&amp;acy; &amp;pcy;&amp;rcy;&amp;ocy;&amp;bcy;&amp;lcy;&amp;iecy;&amp;mcy;&amp;acy; &amp;rcy;&amp;acy;&amp;scy;&amp;pcy;&amp;rcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;rcy;&amp;acy;&amp;ncy;&amp;yacy;&amp;iecy;&amp;tcy;&amp;scy;&amp;yacy; &amp;ncy;&amp;acy; &amp;vcy;&amp;icy;&amp;zcy;&amp;ucy;&amp;acy;&amp;lcy;&amp;softcy;&amp;ncy;&amp;ucy;&amp;yucy; &amp;scy;&amp;ocy;&amp;scy;&amp;tcy;&amp;acy;&amp;vcy;&amp;lcy;&amp;yacy;&amp;yucy;&amp;shchcy;&amp;ucy;&amp;yucy;.&lt;/p&gt;
&lt;p&gt;&amp;KHcy;&amp;ocy;&amp;tcy;&amp;yacy;, &amp;rcy;&amp;acy;&amp;dcy;&amp;icy; &amp;scy;&amp;pcy;&amp;rcy;&amp;acy;&amp;vcy;&amp;iecy;&amp;dcy;&amp;lcy;&amp;icy;&amp;vcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;icy;, &amp;scy;&amp;tcy;&amp;ocy;&amp;icy;&amp;tcy; &amp;ocy;&amp;tcy;&amp;mcy;&amp;iecy;&amp;tcy;&amp;icy;&amp;tcy;&amp;softcy;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;ncy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ycy;&amp;khcy; &amp;vcy;&amp;pcy;&amp;ocy;&amp;lcy;&amp;ncy;&amp;iecy; &amp;ucy;&amp;scy;&amp;tcy;&amp;rcy;&amp;acy;&amp;icy;&amp;vcy;&amp;acy;&amp;iecy;&amp;tcy; &amp;tcy;&amp;ocy;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;ocy;&amp;ncy;&amp;icy; &amp;icy;&amp;mcy;&amp;iecy;&amp;yucy;&amp;tcy;. &amp;Ncy;&amp;ocy; &amp;vcy; &amp;ecy;&amp;tcy;&amp;ocy;&amp;jcy; &amp;scy;&amp;tcy;&amp;acy;&amp;tcy;&amp;softcy;&amp;iecy; &amp;rcy;&amp;iecy;&amp;chcy;&amp;softcy; &amp;ncy;&amp;iecy; &amp;ocy; &amp;ncy;&amp;icy;&amp;khcy; :)&lt;/p&gt;
&lt;h2 id="kastomiziruem-dnspy"&gt;&lt;p class="colored-text-1" style="font-size: 32px;"&gt;&amp;gt;&lt;/p&gt; &amp;Kcy;&amp;acy;&amp;scy;&amp;tcy;&amp;ocy;&amp;mcy;&amp;icy;&amp;zcy;&amp;icy;&amp;rcy;&amp;ucy;&amp;iecy;&amp;mcy; dnSpy&lt;/h2&gt;
&lt;p&gt;&amp;Ncy;&amp;acy;&amp;chcy;&amp;ncy;&amp;iocy;&amp;mcy; &amp;scy;, &amp;pcy;&amp;ocy;&amp;zhcy;&amp;acy;&amp;lcy;&amp;ucy;&amp;jcy;, &amp;ocy;&amp;scy;&amp;ncy;&amp;ocy;&amp;vcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;icy; &amp;icy;&amp;zcy;&amp;lcy;&amp;yucy;&amp;bcy;&amp;iecy;&amp;ncy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;mcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;icy;&amp;mcy;&amp;icy; &amp;icy;&amp;ncy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ucy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;tcy;&amp;acy; &amp;dcy;&amp;lcy;&amp;yacy; &amp;dcy;&amp;iecy;&amp;bcy;&amp;acy;&amp;gcy;&amp;gcy;&amp;icy;&amp;ncy;&amp;gcy;&amp;acy; - &lt;code&gt;dnSpy&lt;/code&gt;. &amp;Icy;&amp;zcy; &amp;kcy;&amp;ocy;&amp;rcy;&amp;ocy;&amp;bcy;&amp;kcy;&amp;icy; &amp;ocy;&amp;ncy; &amp;ucy;&amp;zhcy;&amp;iecy; &amp;pcy;&amp;ocy;&amp;dcy;&amp;dcy;&amp;iecy;&amp;rcy;&amp;zhcy;&amp;icy;&amp;vcy;&amp;acy;&amp;iecy;&amp;tcy; &amp;scy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;ucy; &amp;tcy;&amp;iecy;&amp;mcy; &amp;icy; &amp;shcy;&amp;rcy;&amp;icy;&amp;fcy;&amp;tcy;&amp;acy;, &amp;vcy;&amp;ocy;&amp;tcy; &amp;tcy;&amp;ocy;&amp;lcy;&amp;softcy;&amp;kcy;&amp;ocy; &amp;icy;&amp;khcy; &amp;mcy;&amp;acy;&amp;lcy;&amp;ocy;&amp;vcy;&amp;acy;&amp;tcy;&amp;ocy;. &amp;Scy; &amp;pcy;&amp;ocy;&amp;mcy;&amp;ocy;&amp;shchcy;&amp;softcy;&amp;bcy;&amp;yucy; &amp;icy;&amp;ncy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ucy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;tcy;&amp;acy; &lt;a href="https://github.com/HoLLy-HaCKeR/dnSpyThemeGenerator"&gt;dnSpyThemeGenerator&lt;/a&gt; &amp;ucy; &amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy; &amp;pcy;&amp;ocy;&amp;lcy;&amp;ucy;&amp;chcy;&amp;icy;&amp;lcy;&amp;ocy;&amp;scy;&amp;softcy; &amp;scy;&amp;kcy;&amp;ocy;&amp;ncy;&amp;vcy;&amp;iecy;&amp;rcy;&amp;tcy;&amp;icy;&amp;rcy;&amp;ocy;&amp;vcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;ncy;&amp;iecy;&amp;bcy;&amp;ocy;&amp;lcy;&amp;softcy;&amp;shcy;&amp;ocy;&amp;iecy; &amp;kcy;&amp;ocy;&amp;lcy;&amp;icy;&amp;chcy;&amp;iecy;&amp;scy;&amp;tcy;&amp;vcy;&amp;ocy; &amp;tcy;&amp;iecy;&amp;mcy; &lt;em&gt;(&amp;dcy;&amp;acy;, &amp;yacy; &amp;fcy;&amp;acy;&amp;ncy;&amp;acy;&amp;tcy; &amp;tcy;&amp;iocy;&amp;mcy;&amp;ncy;&amp;ycy;&amp;khcy; &amp;tcy;&amp;iecy;&amp;mcy; :D)&lt;/em&gt; :&lt;/p&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/3.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/3.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;GitHub Dark&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/4.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/4.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Solarized Dark&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/dracula.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/dracula.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Dracula&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Atom One Dark.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Atom One Dark.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Atom One Dark&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Night Owl.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Night Owl.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Night Owl&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Arc Dark.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Arc Dark.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Arc Dark&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Monokai.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Monokai.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Monokai&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Material Palenight.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Material Palenight.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Material Palenight&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Material Deep Ocean.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Material Deep Ocean.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Material Deep Ocean&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Material Oceanic.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Material Oceanic.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Material Oceanic&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Moonlight.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Moonlight.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Moonlight&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Material Darker.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Material Darker.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Material Darker&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;p&gt;&amp;Ncy;&amp;iecy; &amp;ocy;&amp;bcy;&amp;ocy;&amp;jcy;&amp;dcy;&amp;ucy; &amp;scy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ocy;&amp;ncy;&amp;ocy;&amp;jcy; &amp;tcy;&amp;acy;&amp;kcy;&amp;zhcy;&amp;iecy; &amp;shcy;&amp;rcy;&amp;icy;&amp;fcy;&amp;tcy;&amp;ycy;, &amp;scy;&amp;tcy;&amp;acy;&amp;ncy;&amp;dcy;&amp;acy;&amp;rcy;&amp;tcy;&amp;ncy;&amp;ycy;&amp;jcy; &lt;code&gt;Consolas&lt;/code&gt; &amp;kcy;&amp;ocy;&amp;ncy;&amp;iecy;&amp;chcy;&amp;ncy;&amp;ocy; &amp;khcy;&amp;ocy;&amp;rcy;&amp;ocy;&amp;shcy;, &amp;ncy;&amp;ocy; &amp;yacy; &amp;scy;&amp;ocy;&amp;vcy;&amp;iecy;&amp;tcy;&amp;ucy;&amp;yucy; &amp;shcy;&amp;rcy;&amp;icy;&amp;fcy;&amp;tcy;&amp;ycy; &amp;scy; &amp;bcy;&amp;ocy;&amp;lcy;&amp;iecy;&amp;iecy; &amp;ucy;&amp;zcy;&amp;kcy;&amp;icy;&amp;mcy;&amp;icy; &amp;bcy;&amp;ucy;&amp;kcy;&amp;vcy;&amp;acy;&amp;mcy;&amp;icy; &lt;em&gt;(&amp;kcy;&amp;acy;&amp;kcy; JetBrains Mono)&lt;/em&gt;, &amp;ocy;&amp;ncy;&amp;icy; &amp;pcy;&amp;rcy;&amp;icy;&amp;yacy;&amp;tcy;&amp;ncy;&amp;iecy;&amp;iecy; &amp;dcy;&amp;lcy;&amp;yacy; &amp;gcy;&amp;lcy;&amp;acy;&amp;zcy;&amp;acy;, &amp;kcy;&amp;ocy;&amp;gcy;&amp;dcy;&amp;acy; &amp;vcy;&amp;ycy; &amp;icy;&amp;zcy;&amp;ucy;&amp;chcy;&amp;acy;&amp;iecy;&amp;tcy;&amp;iecy; &amp;kcy;&amp;ocy;&amp;dcy;. &amp;Vcy;&amp;ocy;&amp;tcy; &amp;ncy;&amp;iecy;&amp;scy;&amp;kcy;&amp;ocy;&amp;lcy;&amp;softcy;&amp;kcy;&amp;ocy; &amp;shcy;&amp;rcy;&amp;icy;&amp;fcy;&amp;tcy;&amp;ocy;&amp;vcy;:&lt;/p&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Consolas.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Consolas.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Consolas (&amp;pcy;&amp;ocy; &amp;ucy;&amp;mcy;&amp;ocy;&amp;lcy;&amp;chcy;&amp;acy;&amp;ncy;&amp;icy;&amp;yucy;)&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/JetBrains Mono.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/JetBrains Mono.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;JetBrains Mono (&amp;scy; &amp;lcy;&amp;icy;&amp;gcy;&amp;acy;&amp;tcy;&amp;ucy;&amp;rcy;&amp;acy;&amp;mcy;&amp;icy;)&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;div style="padding-bottom: 10px; text-align: center; display: flex"&gt;
&lt;div style="float:left; padding-right: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Fira Code.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Fira Code.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Fira Code (&amp;scy; &amp;lcy;&amp;icy;&amp;gcy;&amp;acy;&amp;tcy;&amp;ucy;&amp;rcy;&amp;acy;&amp;mcy;&amp;icy;)&lt;/p&gt;
&lt;/div&gt;
&lt;div style="float:right; padding-left: 7px"&gt;
&lt;a href="/images/customize-your-debugger/Ubuntu Mono.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/Ubuntu Mono.PNG"/&gt;&lt;/a&gt;
&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;Ubuntu Mono&lt;/p&gt;
&lt;/div&gt;
&lt;/div&gt;
&lt;p&gt;&amp;IEcy;&amp;shchcy;&amp;iocy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;ucy;&amp;scy;&amp;tcy;&amp;acy;&amp;ncy;&amp;ocy;&amp;vcy;&amp;icy;&amp;tcy;&amp;softcy; &amp;fcy;&amp;ocy;&amp;ncy;&amp;ocy;&amp;vcy;&amp;ocy;&amp;iecy; &amp;icy;&amp;zcy;&amp;ocy;&amp;bcy;&amp;rcy;&amp;acy;&amp;zhcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;iecy;:&lt;/p&gt;
&lt;div style="text-align:center"&gt;&lt;a href="/images/customize-your-debugger/backimg.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/backimg.PNG"/&gt;&lt;/a&gt;&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;&amp;Ncy;&amp;acy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;jcy;&amp;kcy;&amp;icy; &amp;fcy;&amp;ocy;&amp;ncy;&amp;ocy;&amp;vcy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;icy;&amp;zcy;&amp;ocy;&amp;bcy;&amp;rcy;&amp;acy;&amp;zhcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;yacy;&lt;/p&gt;&lt;/div&gt;
&lt;p&gt;&amp;Vcy; &amp;ncy;&amp;acy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;jcy;&amp;kcy;&amp;acy;&amp;khcy; &amp;dcy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;mcy;&amp;pcy;&amp;icy;&amp;lcy;&amp;yacy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;acy; &amp;tcy;&amp;acy;&amp;kcy;&amp;zhcy;&amp;iecy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;ncy;&amp;acy;&amp;jcy;&amp;tcy;&amp;icy; &amp;mcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;pcy;&amp;ocy;&amp;lcy;&amp;iecy;&amp;zcy;&amp;ncy;&amp;ycy;&amp;khcy; &amp;chcy;&amp;iecy;&amp;kcy;&amp;bcy;&amp;ocy;&amp;kcy;&amp;scy;&amp;ocy;&amp;vcy;, &amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ycy;&amp;iecy; &amp;mcy;&amp;ocy;&amp;gcy;&amp;ucy;&amp;tcy; &amp;scy;&amp;dcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;acy;&amp;ncy;&amp;acy;&amp;lcy;&amp;icy;&amp;zcy; &amp;bcy;&amp;ocy;&amp;lcy;&amp;iecy;&amp;iecy; &amp;pcy;&amp;rcy;&amp;icy;&amp;yacy;&amp;tcy;&amp;ncy;&amp;ycy;&amp;mcy;. &amp;Ncy;&amp;acy;&amp;pcy;&amp;rcy;&amp;icy;&amp;mcy;&amp;iecy;&amp;rcy;, &amp;vcy; &amp;rcy;&amp;iecy;&amp;zhcy;&amp;icy;&amp;mcy;&amp;iecy; &amp;pcy;&amp;rcy;&amp;ocy;&amp;scy;&amp;mcy;&amp;ocy;&amp;tcy;&amp;rcy;&amp;acy; IL &amp;dcy;&amp;lcy;&amp;yacy; &amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy; &amp;ncy;&amp;iecy; &amp;tcy;&amp;acy;&amp;kcy; &amp;vcy;&amp;acy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;zcy;&amp;ncy;&amp;acy;&amp;tcy;&amp;softcy; &amp;scy;&amp;mcy;&amp;iecy;&amp;shchcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;yacy; &amp;icy;&amp;ncy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ucy;&amp;kcy;&amp;tscy;&amp;icy;&amp;jcy;, &amp;ncy;&amp;ocy;&amp;mcy;&amp;iecy;&amp;rcy;&amp;acy; &amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;kcy; &amp;vcy; &amp;fcy;&amp;acy;&amp;jcy;&amp;lcy;&amp;iecy; &amp;icy; &amp;pcy;&amp;rcy;&amp;ocy;&amp;chcy;&amp;iecy;&amp;iecy;. &amp;YAcy; &amp;mcy;&amp;acy;&amp;kcy;&amp;scy;&amp;icy;&amp;mcy;&amp;acy;&amp;lcy;&amp;softcy;&amp;ncy;&amp;ocy; &amp;ucy;&amp;pcy;&amp;rcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;icy;&amp;lcy; &amp;scy;&amp;ocy;&amp;dcy;&amp;iecy;&amp;rcy;&amp;zhcy;&amp;icy;&amp;mcy;&amp;ocy;&amp;iecy;:&lt;/p&gt;
&lt;div style="text-align:center"&gt;&lt;a href="/images/customize-your-debugger/ilview.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/ilview.PNG"/&gt;&lt;/a&gt;&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;&amp;Rcy;&amp;iecy;&amp;zhcy;&amp;icy;&amp;mcy; &amp;ocy;&amp;tcy;&amp;ocy;&amp;bcy;&amp;rcy;&amp;acy;&amp;zhcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;yacy; IL&lt;/p&gt;&lt;/div&gt;
&lt;p&gt;&amp;Rcy;&amp;iecy;&amp;zcy;&amp;yucy;&amp;mcy;&amp;icy;&amp;rcy;&amp;ucy;&amp;yacy;, dnSpy &amp;pcy;&amp;ocy;&amp;dcy;&amp;dcy;&amp;iecy;&amp;rcy;&amp;zhcy;&amp;icy;&amp;vcy;&amp;acy;&amp;iecy;&amp;tcy; &amp;mcy;&amp;ncy;&amp;ocy;&amp;zhcy;&amp;iecy;&amp;scy;&amp;tcy;&amp;vcy;&amp;ocy; &amp;ncy;&amp;acy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;iecy;&amp;kcy; &amp;icy; &amp;iecy;&amp;gcy;&amp;ocy; &amp;dcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;acy;&amp;tcy;&amp;ocy;&amp;chcy;&amp;ncy;&amp;ocy; &amp;lcy;&amp;iecy;&amp;gcy;&amp;kcy;&amp;ocy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;kcy;&amp;acy;&amp;scy;&amp;tcy;&amp;ocy;&amp;mcy;&amp;icy;&amp;zcy;&amp;icy;&amp;rcy;&amp;ocy;&amp;vcy;&amp;acy;&amp;tcy;&amp;softcy;.&lt;/p&gt;
&lt;h2 id="kastomiziruem-ilspy"&gt;&lt;p class="colored-text-1" style="font-size: 32px;"&gt;&amp;gt;&lt;/p&gt; &amp;Kcy;&amp;acy;&amp;scy;&amp;tcy;&amp;ocy;&amp;mcy;&amp;icy;&amp;zcy;&amp;icy;&amp;rcy;&amp;ucy;&amp;iecy;&amp;mcy; ilSpy&lt;/h2&gt;
&lt;p&gt;&amp;Mcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;lcy;&amp;yucy;&amp;dcy;&amp;iecy;&amp;jcy; &amp;vcy;&amp;ocy;&amp;kcy;&amp;rcy;&amp;ucy;&amp;gcy; &amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy; &amp;pcy;&amp;ocy;&amp;chcy;&amp;iecy;&amp;mcy;&amp;ucy;-&amp;tcy;&amp;ocy; &amp;icy;&amp;gcy;&amp;ncy;&amp;ocy;&amp;rcy;&amp;icy;&amp;rcy;&amp;ucy;&amp;yucy;&amp;tcy; &amp;scy;&amp;ucy;&amp;shchcy;&amp;iecy;&amp;scy;&amp;tcy;&amp;vcy;&amp;ocy;&amp;vcy;&amp;acy;&amp;ncy;&amp;icy;&amp;iecy; &lt;code&gt;ilSpy&lt;/code&gt;, &amp;ncy;&amp;iecy;&amp;scy;&amp;mcy;&amp;ocy;&amp;tcy;&amp;rcy;&amp;yacy; &amp;ncy;&amp;acy; &amp;tcy;&amp;ocy;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;ecy;&amp;tcy;&amp;ocy; &amp;khcy;&amp;ocy;&amp;tcy;&amp;softcy; &amp;icy; &amp;bcy;&amp;ocy;&amp;lcy;&amp;iecy;&amp;iecy; &amp;scy;&amp;tcy;&amp;acy;&amp;rcy;&amp;ycy;&amp;jcy; &amp;icy;&amp;ncy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ucy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;tcy;, &amp;ucy; &amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;ncy;&amp;iecy;&amp;tcy; &amp;ocy;&amp;tcy;&amp;lcy;&amp;acy;&amp;dcy;&amp;chcy;&amp;icy;&amp;kcy;&amp;acy; &amp;icy; &amp;dcy;&amp;rcy;&amp;ucy;&amp;gcy;&amp;icy;&amp;khcy; &amp;pcy;&amp;ocy;&amp;lcy;&amp;iecy;&amp;zcy;&amp;ncy;&amp;ycy;&amp;khcy; &amp;vcy;&amp;iecy;&amp;shchcy;&amp;iecy;&amp;jcy; &amp;icy;&amp;zcy; &lt;code&gt;dnSpy&lt;/code&gt;, &amp;iecy;&amp;gcy;&amp;ocy; &amp;dcy;&amp;vcy;&amp;icy;&amp;zhcy;&amp;ocy;&amp;kcy; &amp;dcy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;mcy;&amp;pcy;&amp;icy;&amp;lcy;&amp;yacy;&amp;tscy;&amp;icy;&amp;icy; &amp;ucy;&amp;mcy;&amp;iecy;&amp;iecy;&amp;tcy; &amp;dcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;icy;&amp;ncy;&amp;tcy;&amp;iecy;&amp;rcy;&amp;iecy;&amp;scy;&amp;ncy;&amp;ycy;&amp;iecy; &amp;tcy;&amp;rcy;&amp;yucy;&amp;kcy;&amp;icy;, &amp;rcy;&amp;iecy;&amp;chcy;&amp;icy; &amp;ocy; &amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ycy;&amp;khcy; &amp;vcy; dnSpy &amp;icy;&amp;dcy;&amp;tcy;&amp;icy; &amp;ncy;&amp;iecy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;iecy;&amp;tcy;.&lt;/p&gt;
&lt;p&gt;&amp;Tcy;&amp;iecy;&amp;pcy;&amp;iecy;&amp;rcy;&amp;softcy; &amp;dcy;&amp;acy;&amp;vcy;&amp;acy;&amp;jcy;&amp;tcy;&amp;iecy; &amp;pcy;&amp;ocy;&amp;scy;&amp;mcy;&amp;ocy;&amp;tcy;&amp;rcy;&amp;icy;&amp;mcy;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;icy;&amp;zcy; &amp;kcy;&amp;acy;&amp;scy;&amp;tcy;&amp;ocy;&amp;mcy;&amp;icy;&amp;zcy;&amp;acy;&amp;tscy;&amp;icy;&amp;icy; &amp;ncy;&amp;acy;&amp;mcy; &amp;dcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;ucy;&amp;pcy;&amp;ncy;&amp;ocy;:&lt;/p&gt;
&lt;div style="text-align:center"&gt;&lt;a href="/images/customize-your-debugger/ils_settings.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/ils_settings.PNG"/&gt;&lt;/a&gt;&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;&amp;Ocy;&amp;kcy;&amp;ncy;&amp;ocy; &amp;ncy;&amp;acy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;iecy;&amp;kcy; ilSpy&lt;/p&gt;&lt;/div&gt;
&lt;p&gt;&amp;Icy;&amp;ncy;&amp;tcy;&amp;iecy;&amp;rcy;&amp;fcy;&amp;iecy;&amp;jcy;&amp;scy; &amp;zcy;&amp;dcy;&amp;iecy;&amp;scy;&amp;softcy; &amp;ocy;&amp;tcy;&amp;lcy;&amp;icy;&amp;chcy;&amp;acy;&amp;iecy;&amp;tcy;&amp;scy;&amp;yacy; &amp;ocy;&amp;tcy; dnSpy. &amp;Mcy;&amp;ycy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;iecy;&amp;mcy; &amp;ucy;&amp;pcy;&amp;rcy;&amp;acy;&amp;vcy;&amp;lcy;&amp;yacy;&amp;tcy;&amp;softcy; &amp;dcy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;mcy;&amp;pcy;&amp;icy;&amp;lcy;&amp;yacy;&amp;tscy;&amp;icy;&amp;iecy;&amp;jcy; &amp;kcy;&amp;acy;&amp;zhcy;&amp;dcy;&amp;ocy;&amp;jcy; &amp;fcy;&amp;icy;&amp;chcy;&amp;icy; &amp;icy;&amp;zcy; &amp;kcy;&amp;acy;&amp;zhcy;&amp;dcy;&amp;ocy;&amp;jcy; &amp;vcy;&amp;iecy;&amp;rcy;&amp;scy;&amp;icy;&amp;icy; &amp;yacy;&amp;zcy;&amp;ycy;&amp;kcy;&amp;acy;, &amp;tcy;&amp;acy;&amp;kcy; &amp;zhcy;&amp;iecy; &amp;iecy;&amp;scy;&amp;tcy;&amp;softcy; &amp;ncy;&amp;acy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;jcy;&amp;kcy;&amp;icy; &amp;ecy;&amp;kcy;&amp;scy;&amp;pcy;&amp;ocy;&amp;rcy;&amp;tcy;&amp;acy; &amp;vcy; &amp;pcy;&amp;rcy;&amp;ocy;&amp;iecy;&amp;kcy;&amp;tcy; &lt;em&gt;(&amp;kcy;&amp;scy;&amp;tcy;&amp;acy;&amp;tcy;&amp;icy;, &amp;zcy;&amp;dcy;&amp;iecy;&amp;scy;&amp;softcy; &amp;ocy;&amp;ncy; &amp;ecy;&amp;kcy;&amp;scy;&amp;pcy;&amp;ocy;&amp;rcy;&amp;tcy;&amp;icy;&amp;rcy;&amp;ucy;&amp;iecy;&amp;tcy;&amp;scy;&amp;yacy; &amp;bcy;&amp;iecy;&amp;zcy; *.sln!)&lt;/em&gt;, &amp;acy; &amp;tcy;&amp;acy;&amp;kcy;&amp;zhcy;&amp;iecy; &amp;ncy;&amp;iecy;&amp;mcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;ncy;&amp;acy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ocy;&amp;iecy;&amp;kcy; &amp;dcy;&amp;lcy;&amp;yacy; &amp;scy;&amp;acy;&amp;mcy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;dcy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;mcy;&amp;pcy;&amp;icy;&amp;lcy;&amp;yacy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;acy;.&lt;/p&gt;
&lt;p&gt;&amp;SHcy;&amp;rcy;&amp;icy;&amp;fcy;&amp;tcy; &amp;pcy;&amp;ocy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy;&amp;tcy;&amp;softcy; &amp;dcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;acy;&amp;tcy;&amp;ocy;&amp;chcy;&amp;ncy;&amp;ocy; &amp;pcy;&amp;rcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;ocy;, &amp;ncy;&amp;ocy; &amp;gcy;&amp;dcy;&amp;iecy; &amp;zhcy;&amp;iecy; &amp;pcy;&amp;ocy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy;&amp;tcy;&amp;softcy; &amp;tscy;&amp;vcy;&amp;iecy;&amp;tcy;&amp;ocy;&amp;vcy;&amp;ucy;&amp;yucy; &amp;pcy;&amp;acy;&amp;lcy;&amp;icy;&amp;tcy;&amp;rcy;&amp;ucy;? &amp;CHcy;&amp;iecy;&amp;scy;&amp;tcy;&amp;ncy;&amp;ocy; &amp;gcy;&amp;ocy;&amp;vcy;&amp;ocy;&amp;rcy;&amp;yacy;, &amp;mcy;&amp;ncy;&amp;iecy; &amp;ocy;&amp;chcy;&amp;iecy;&amp;ncy;&amp;softcy; &amp;ncy;&amp;iecy; &amp;pcy;&amp;ocy;&amp;ncy;&amp;rcy;&amp;acy;&amp;vcy;&amp;icy;&amp;lcy;&amp;acy;&amp;scy;&amp;softcy; &amp;scy;&amp;tcy;&amp;acy;&amp;ncy;&amp;dcy;&amp;acy;&amp;rcy;&amp;tcy;&amp;ncy;&amp;acy;&amp;yacy; &amp;zcy;&amp;iecy;&amp;lcy;&amp;iocy;&amp;ncy;&amp;ocy;-&amp;kcy;&amp;ocy;&amp;rcy;&amp;icy;&amp;chcy;&amp;ncy;&amp;iecy;&amp;vcy;&amp;acy;&amp;yacy; &amp;tcy;&amp;iecy;&amp;mcy;&amp;acy; ilSpy, &amp;yacy; &amp;scy;&amp;rcy;&amp;acy;&amp;zcy;&amp;ucy; &amp;zcy;&amp;acy;&amp;khcy;&amp;ocy;&amp;tcy;&amp;iecy;&amp;lcy; &amp;iecy;&amp;iocy; &amp;pcy;&amp;ocy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy;&amp;tcy;&amp;softcy;. &amp;Ocy;&amp;kcy;&amp;acy;&amp;zcy;&amp;ycy;&amp;vcy;&amp;acy;&amp;iecy;&amp;tcy;&amp;scy;&amp;yacy;, ilSpy &amp;ncy;&amp;iecy; &amp;pcy;&amp;rcy;&amp;iecy;&amp;dcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;acy;&amp;vcy;&amp;lcy;&amp;yacy;&amp;iecy;&amp;tcy; &amp;vcy;&amp;ocy;&amp;zcy;&amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy;&amp;scy;&amp;tcy;&amp;icy; &amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy;&amp;tcy;&amp;softcy; &amp;tcy;&amp;iecy;&amp;mcy;&amp;ucy; &amp;vcy; &amp;pcy;&amp;acy;&amp;rcy;&amp;ucy; &amp;kcy;&amp;lcy;&amp;icy;&amp;kcy;&amp;ocy;&amp;vcy;, &amp;pcy;&amp;ocy;&amp;ecy;&amp;tcy;&amp;ocy;&amp;mcy;&amp;ucy; &amp;pcy;&amp;rcy;&amp;icy;&amp;dcy;&amp;iecy;&amp;tcy;&amp;scy;&amp;yacy; &amp;scy;&amp;ocy;&amp;zcy;&amp;dcy;&amp;acy;&amp;vcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;iecy;&amp;iocy; &amp;scy;&amp;acy;&amp;mcy;&amp;ocy;&amp;scy;&amp;tcy;&amp;ocy;&amp;yacy;&amp;tcy;&amp;iecy;&amp;lcy;&amp;softcy;&amp;ncy;&amp;ocy;. &amp;Vcy;&amp;ocy;&amp;tcy;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;ucy; &amp;mcy;&amp;iecy;&amp;ncy;&amp;yacy; &amp;pcy;&amp;ocy;&amp;lcy;&amp;ucy;&amp;chcy;&amp;icy;&amp;lcy;&amp;ocy;&amp;scy;&amp;softcy;:&lt;/p&gt;
&lt;div style="text-align:center"&gt;&lt;a href="/images/customize-your-debugger/ils_mt.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/ils_mt.PNG"/&gt;&lt;/a&gt;&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;&amp;Mcy;&amp;ocy;&amp;yacy; &amp;tscy;&amp;vcy;&amp;iecy;&amp;tcy;&amp;ocy;&amp;vcy;&amp;acy;&amp;yacy; &amp;pcy;&amp;acy;&amp;lcy;&amp;icy;&amp;tcy;&amp;rcy;&amp;acy; &amp;vcy; ilSpy&lt;/p&gt;&lt;/div&gt;
&lt;p&gt;&amp;Dcy;&amp;acy;&amp;vcy;&amp;acy;&amp;jcy;&amp;tcy;&amp;iecy; &amp;yacy; &amp;rcy;&amp;acy;&amp;scy;&amp;scy;&amp;kcy;&amp;acy;&amp;zhcy;&amp;ucy;, &amp;kcy;&amp;acy;&amp;kcy; &amp;mcy;&amp;ncy;&amp;iecy; &amp;ecy;&amp;tcy;&amp;ocy; &amp;ucy;&amp;dcy;&amp;acy;&amp;lcy;&amp;ocy;&amp;scy;&amp;softcy;.
&amp;Vcy;&amp;scy;&amp;iecy; &amp;tcy;&amp;iecy;&amp;mcy;&amp;ycy; &amp;ncy;&amp;acy;&amp;khcy;&amp;ocy;&amp;dcy;&amp;yacy;&amp;tcy;&amp;scy;&amp;yacy; &amp;vcy;&amp;ncy;&amp;ucy;&amp;tcy;&amp;rcy;&amp;icy; &lt;code&gt;ilSpy.dll&lt;/code&gt;, &amp;vcy; &amp;rcy;&amp;iecy;&amp;scy;&amp;ucy;&amp;rcy;&amp;scy;&amp;acy;&amp;khcy;. &amp;Kcy; &amp;scy;&amp;ocy;&amp;zhcy;&amp;acy;&amp;lcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;yucy;, &amp;icy;&amp;ncy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ucy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;tcy;&amp;ocy;&amp;vcy; &amp;yacy; &amp;ncy;&amp;iecy; &amp;ncy;&amp;acy;&amp;shcy;&amp;iecy;&amp;lcy;, &amp;pcy;&amp;ocy;&amp;ecy;&amp;tcy;&amp;ocy;&amp;mcy;&amp;ucy; &amp;pcy;&amp;rcy;&amp;icy;&amp;shcy;&amp;lcy;&amp;ocy;&amp;scy;&amp;softcy; &amp;dcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;vcy;&amp;scy;&amp;iocy; &amp;rcy;&amp;ucy;&amp;kcy;&amp;acy;&amp;mcy;&amp;icy; &amp;vcy; &amp;tcy;&amp;iecy;&amp;kcy;&amp;scy;&amp;tcy;&amp;ocy;&amp;vcy;&amp;ocy;&amp;mcy; &amp;rcy;&amp;iecy;&amp;dcy;&amp;acy;&amp;kcy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;iecy;. &amp;Pcy;&amp;rcy;&amp;ocy;&amp;tscy;&amp;iecy;&amp;scy;&amp;scy; &amp;tcy;&amp;rcy;&amp;ucy;&amp;dcy;&amp;ocy;&amp;iocy;&amp;mcy;&amp;kcy;&amp;icy;&amp;jcy;, &amp;ncy;&amp;ocy; &amp;rcy;&amp;iecy;&amp;zcy;&amp;ucy;&amp;lcy;&amp;softcy;&amp;tcy;&amp;acy;&amp;tcy; &amp;iecy;&amp;gcy;&amp;ocy; &amp;ocy;&amp;pcy;&amp;rcy;&amp;acy;&amp;vcy;&amp;dcy;&amp;ycy;&amp;vcy;&amp;acy;&amp;iecy;&amp;tcy;.&lt;/p&gt;
&lt;div style="text-align:center"&gt;&lt;a href="/images/customize-your-debugger/ils_tut.PNG"&gt;&lt;img alt="a" class="img-resize" src="/images/customize-your-debugger/ils_tut.PNG"/&gt;&lt;/a&gt;&lt;br/&gt;&lt;p class="light-dark-text" style="font-size: 16px;"&gt;&amp;Rcy;&amp;acy;&amp;scy;&amp;pcy;&amp;ocy;&amp;lcy;&amp;ocy;&amp;zhcy;&amp;iecy;&amp;ncy;&amp;icy;&amp;iecy; &amp;fcy;&amp;acy;&amp;jcy;&amp;lcy;&amp;ocy;&amp;vcy; &amp;tcy;&amp;iecy;&amp;mcy; &amp;vcy; &amp;rcy;&amp;iecy;&amp;scy;&amp;ucy;&amp;rcy;&amp;scy;&amp;acy;&amp;khcy; ilSpy.dll&lt;/p&gt;&lt;/div&gt;
&lt;p&gt;&amp;Kcy;&amp;scy;&amp;tcy;&amp;acy;&amp;tcy;&amp;icy;, ilSpy &amp;pcy;&amp;ocy; &amp;gcy;&amp;ocy;&amp;rcy;&amp;yacy;&amp;chcy;&amp;iecy;&amp;jcy; &amp;kcy;&amp;lcy;&amp;acy;&amp;vcy;&amp;icy;&amp;shcy;&amp;iecy; &lt;code&gt;F5&lt;/code&gt; &amp;pcy;&amp;iecy;&amp;rcy;&amp;iecy;&amp;zcy;&amp;acy;&amp;gcy;&amp;rcy;&amp;ucy;&amp;zhcy;&amp;acy;&amp;iecy;&amp;tcy; &amp;scy;&amp;bcy;&amp;ocy;&amp;rcy;&amp;kcy;&amp;ucy; &lt;em&gt;(&amp;vcy; dnSpy &amp;ecy;&amp;tcy;&amp;ocy; &amp;ncy;&amp;ucy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;dcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;rcy;&amp;ucy;&amp;kcy;&amp;acy;&amp;mcy;&amp;icy;)&lt;/em&gt;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;iecy;&amp;tcy; &amp;bcy;&amp;ycy;&amp;tcy;&amp;softcy; &amp;ocy;&amp;chcy;&amp;iecy;&amp;ncy;&amp;softcy; &amp;ucy;&amp;dcy;&amp;ocy;&amp;bcy;&amp;ncy;&amp;ocy; &amp;vcy; &amp;ncy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ycy;&amp;khcy; &amp;scy;&amp;lcy;&amp;ucy;&amp;chcy;&amp;acy;&amp;yacy;&amp;khcy;.&lt;/p&gt;
&lt;h2 id="podvodia-itogi"&gt;&lt;p class="colored-text-1" style="font-size: 32px;"&gt;&amp;gt;&lt;/p&gt; &amp;Pcy;&amp;ocy;&amp;dcy;&amp;vcy;&amp;ocy;&amp;dcy;&amp;yacy; &amp;icy;&amp;tcy;&amp;ocy;&amp;gcy;&amp;icy;&lt;/h2&gt;
&lt;p&gt;&amp;Ocy;&amp;bcy;&amp;ocy;&amp;icy;&amp;mcy; &amp;icy;&amp;ncy;&amp;scy;&amp;tcy;&amp;rcy;&amp;ucy;&amp;mcy;&amp;iecy;&amp;ncy;&amp;tcy;&amp;acy;&amp;mcy;, &amp;kcy;&amp;acy;&amp;kcy; &lt;code&gt;dnSpy&lt;/code&gt;, &amp;tcy;&amp;acy;&amp;kcy; &amp;icy; &lt;code&gt;ilSpy&lt;/code&gt;, &amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;pcy;&amp;rcy;&amp;icy;&amp;dcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;vcy;&amp;ncy;&amp;iecy;&amp;shcy;&amp;ncy;&amp;icy;&amp;jcy; &amp;vcy;&amp;icy;&amp;dcy; &amp;pcy;&amp;ocy; &amp;scy;&amp;vcy;&amp;ocy;&amp;iecy;&amp;mcy;&amp;ucy; &amp;zhcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;ncy;&amp;icy;&amp;yucy;, &amp;chcy;&amp;tcy;&amp;ocy;&amp;bcy;&amp;ycy; &amp;scy;&amp;dcy;&amp;iecy;&amp;lcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;rcy;&amp;acy;&amp;bcy;&amp;ocy;&amp;tcy;&amp;ucy; &amp;scy; &amp;ncy;&amp;icy;&amp;mcy;&amp;icy; &amp;ncy;&amp;iecy;&amp;mcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;bcy;&amp;ocy;&amp;lcy;&amp;iecy;&amp;iecy; &amp;kcy;&amp;ocy;&amp;mcy;&amp;fcy;&amp;ocy;&amp;rcy;&amp;tcy;&amp;ncy;&amp;ocy;&amp;jcy;. &amp;Kcy;&amp;scy;&amp;tcy;&amp;acy;&amp;tcy;&amp;icy;, &amp;yacy; &amp;bcy;&amp;ycy;&amp;lcy; &amp;ucy;&amp;dcy;&amp;icy;&amp;vcy;&amp;lcy;&amp;iecy;&amp;ncy;, &amp;ncy;&amp;ocy; &amp;ncy;&amp;iecy;&amp;kcy;&amp;ocy;&amp;tcy;&amp;ocy;&amp;rcy;&amp;ycy;&amp;iecy; &amp;ncy;&amp;iecy; &amp;zcy;&amp;ncy;&amp;acy;&amp;yucy;&amp;tcy;, &amp;chcy;&amp;tcy;&amp;ocy; &amp;icy; &amp;tcy;&amp;acy;&amp;mcy;, &amp;icy; &amp;tcy;&amp;acy;&amp;mcy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy; &amp;vcy;&amp;kcy;&amp;lcy;&amp;yucy;&amp;chcy;&amp;icy;&amp;tcy;&amp;softcy; &lt;code&gt;Shell Extension&lt;/code&gt;, &amp;chcy;&amp;tcy;&amp;ocy;&amp;bcy;&amp;ycy; &amp;ocy;&amp;tcy;&amp;kcy;&amp;rcy;&amp;ycy;&amp;vcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;fcy;&amp;acy;&amp;jcy;&amp;lcy; &amp;vcy; &amp;ncy;&amp;ucy;&amp;zhcy;&amp;ncy;&amp;ocy;&amp;mcy; &amp;ocy;&amp;tcy;&amp;lcy;&amp;acy;&amp;dcy;&amp;chcy;&amp;icy;&amp;kcy;&amp;iecy; &amp;icy;&amp;zcy; &amp;kcy;&amp;ocy;&amp;ncy;&amp;tcy;&amp;iecy;&amp;kcy;&amp;scy;&amp;tcy;&amp;ncy;&amp;ocy;&amp;gcy;&amp;ocy; &amp;mcy;&amp;iecy;&amp;ncy;&amp;yucy; &amp;fcy;&amp;acy;&amp;jcy;&amp;lcy;&amp;acy;. &lt;/p&gt;
&lt;p&gt;&amp;Scy;&amp;kcy;&amp;acy;&amp;chcy;&amp;acy;&amp;tcy;&amp;softcy; &amp;tcy;&amp;iecy;&amp;mcy;&amp;ycy; &amp;icy; &amp;shcy;&amp;rcy;&amp;icy;&amp;fcy;&amp;tcy;&amp;ycy; &amp;mcy;&amp;ocy;&amp;zhcy;&amp;ncy;&amp;ocy;, &amp;ncy;&amp;acy;&amp;zhcy;&amp;acy;&amp;vcy; &lt;a download="" href="/files/customize-your-debugger/themes.7z"&gt;&amp;scy;&amp;yucy;&amp;dcy;&amp;acy;&lt;/a&gt;.&lt;/p&gt;</content><category term="Customization"></category><category term="dnspy"></category><category term="ilspy"></category><category term="debugger"></category><category term="customization"></category></entry></feed>